Revit 2024 API
HasNoValueFilterRule Class
 Tests whether an element's parameter doesn't have a value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public class HasNoValueFilterRule : ParameterValuePresenceRule
Visual Basic
Public Class HasNoValueFilterRule _
	Inherits ParameterValuePresenceRule
Visual C++
public ref class HasNoValueFilterRule : public ParameterValuePresenceRule
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterRule
 Autodesk.Revit.DB.ParameterValuePresenceRule
 Autodesk.Revit.DB.HasNoValueFilterRule
See Also
HasNoValueFilterRule Members
Autodesk.Revit.DB Namespace